powerfull/src/Documents/РеализацияУслуг/РеализацияУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияУслуг</name>
  <basedOn>Document.ЗаписьКлиента</basedOn>
  <registerRecords>AccumulationRegister.ПродажаУслуг</registerRecords>
  <registerRecords>AccumulationRegister.ДеньгиОтПродажиУслугИАбонементов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Запись</name>
    <type>
      <types>DocumentRef.ЗаписьКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/AccumulationRegisters/ПродажаУслуг/ПродажаУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажаУслуг</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

powerfull/src/AccumulationRegisters/ДеньгиОтПродажиУслугИАбонементов/ДеньгиОтПродажиУслугИАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДеньгиОтПродажиУслугИАбонементов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

powerfull/src/Enums/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Оплата</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Карта</name>
  </enumValues>
</mdclass:Enum>

powerfull/src/Enums/ТипДенежныхСредств/ТипДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
</mdclass:Enum>

powerfull/src/Documents/РеализацияУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажаУслуг 
	Движения.ПродажаУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаОказываемыеУслуги Из ОказываемыеУслуги Цикл
		Движение = Движения.ПродажаУслуг.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Услуга = ТекСтрокаОказываемыеУслуги.Услуга;
		Движение.Тренер = Тренер;
		Движение.Цена = ТекСтрокаОказываемыеУслуги.Цена;
	КонецЦикла;

	// регистр ДеньгиОтПродажиУслугИАбонементов Приход
	Движения.ДеньгиОтПродажиУслугИАбонементов.Записывать = Истина;
	Движение = Движения.ДеньгиОтПродажиУслугИАбонементов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплаты(ТипОплаты);
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаписьКлиента") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Запись = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Тренер = ДанныеЗаполнения.Тренер;
		Для Каждого ТекСтрокаОказываемыеУслуги Из ДанныеЗаполнения.ОказываемыеУслуги Цикл
			НоваяСтрока = ОказываемыеУслуги.Добавить();
			НоваяСтрока.Услуга = ТекСтрокаОказываемыеУслуги.Услуга;
			НоваяСтрока.Цена = ТекСтрокаОказываемыеУслуги.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Функция ТипДенежныхСредствПоСпособуОплаты(ТипОплаты)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.Оплата.Наличные, Перечисления.ТипДенежныхСредств.Наличные);
	Соответствие.Вставить(Перечисления.Оплата.Карта, Перечисления.ТипДенежныхСредств.Безналичные);
	
	
	Возврат Соответствие[ТипОплаты];
КонецФункции
